**QUESTION 1: Create a Database**

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

**Create an empty database named cssys**

In [3]:
%sql sqlite:///cssys.db

'Connected: @cssys.db'

**Create a table named students**

In [4]:
%%sql

create table students
(
    id integer,
    firstname char(15),
    lastname char(15),
    age integer,
    gender char(1),
    gpa double,
    Primary Key (id)
)

 * sqlite:///cssys.db
Done.

[]

**Create a table named courses

In [5]:
%%sql

create table courses
(
    id integer,
    name varchar(30),
    credit integer,
    prereq integer,
    Primary Key (id,prereq)
)

 * sqlite:///cssys.db
Done.

[]

**Create a table named transcript**

In [6]:
%%sql
create table transcript
(
    studentid integer,
    courseid integer,
    mark double,
    semester integer,
    credit integer,
    primary key (studentid,courseid)
)

 * sqlite:///cssys.db
Done.

[]

In [7]:
%%sql

SELECT * FROM students

 * sqlite:///cssys.db
Done.

[]

In [8]:
%%sql

SELECT * FROM courses

 * sqlite:///cssys.db
Done.

[]

In [9]:
%%sql

SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[]

**Question 2: Modify a database**

In [10]:
%%sql 

ALTER TABLE students RENAME TO temp_students

 * sqlite:///cssys.db
Done.

[]

In [11]:
%%sql

CREATE TABLE students
(
    id INTEGER,
    firstname CHAR(15),
    lastname CHAR(15),
    DateofBirth DATE DEFAULT '0000-00-00',
    gender CHAR(1),
    gpa DOUBLE,
    Primary Key (id)
)

 * sqlite:///cssys.db
Done.

[]

In [12]:
%%sql

DROP TABLE temp_students

 * sqlite:///cssys.db
Done.

[]

In [13]:
%%sql

SELECT * FROM students

 * sqlite:///cssys.db
Done.

[]

**Question 3: Add data to a database**

**Add rows to students**

In [14]:
%%sql

INSERT INTO students VALUES ('1001', 'adam' , 'smith', '2000-01-03', 'm', '3.1')

 * sqlite:///cssys.db
1 rows affected.

[]

In [15]:
%%sql

INSERT INTO students VALUES ('1002', 'alice' , 'frank', '1999-03-11', 'f', '3.4')

 * sqlite:///cssys.db
1 rows affected.

[]

In [16]:
%%sql

INSERT INTO students VALUES ('1003', 'bob' , 'hal', '1999-09-01', 'm', '2')

 * sqlite:///cssys.db
1 rows affected.

[]

In [17]:
%%sql

SELECT * FROM students

 * sqlite:///cssys.db
Done.

[(1001, 'adam', 'smith', '2000-01-03', 'm', 3.1),
 (1002, 'alice', 'frank', '1999-03-11', 'f', 3.4),
 (1003, 'bob', 'hal', '1999-09-01', 'm', 2.0)]

**Add rows to courses**

In [18]:
%%sql

INSERT INTO courses VALUES ('100', 'programming', '3', NULL)

 * sqlite:///cssys.db
1 rows affected.

[]

In [19]:
%%sql

INSERT INTO courses VALUES ('110', 'math', '3', NULL)

 * sqlite:///cssys.db
1 rows affected.

[]

In [20]:
%%sql

INSERT INTO courses VALUES ('120', 'web', '4', NULL)

 * sqlite:///cssys.db
1 rows affected.

[]

In [21]:
%%sql

INSERT INTO courses VALUES ('301', 'networking', '4', '200')

 * sqlite:///cssys.db
1 rows affected.

[]

In [22]:
%%sql

INSERT INTO courses VALUES ('301', 'networking', '4', '150')

 * sqlite:///cssys.db
1 rows affected.

[]

In [23]:
%%sql

INSERT INTO courses VALUES ('301', 'networking', '4', '210')

 * sqlite:///cssys.db
1 rows affected.

[]

In [24]:
%%sql

INSERT INTO courses VALUES ('354', 'database', '3', '120')

 * sqlite:///cssys.db
1 rows affected.

[]

In [25]:
%%sql

INSERT INTO courses VALUES ('354', 'database', '3', '110')

 * sqlite:///cssys.db
1 rows affected.

[]

In [26]:
%%sql

INSERT INTO courses VALUES ('360', 'os', '3', '150')

 * sqlite:///cssys.db
1 rows affected.

[]

In [27]:
%%sql

INSERT INTO courses VALUES ('360', 'os', '3', '210')

 * sqlite:///cssys.db
1 rows affected.

[]

In [28]:
%%sql

SELECT * FROM courses

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (120, 'web', 4, None),
 (301, 'networking', 4, 200),
 (301, 'networking', 4, 150),
 (301, 'networking', 4, 210),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

**Add rows to transcript**

In [29]:
%%sql

INSERT INTO transcript VALUES ('1001', '100', '3', '201801', '3')

 * sqlite:///cssys.db
1 rows affected.

[]

In [30]:
%%sql

INSERT INTO transcript VALUES ('1001', '110', '3.5', '201801', '3')

 * sqlite:///cssys.db
1 rows affected.

[]

In [31]:
%%sql

INSERT INTO transcript VALUES ('1001', '120', '2.7', '201801', '4')

 * sqlite:///cssys.db
1 rows affected.

[]

In [32]:
%%sql

INSERT INTO transcript VALUES ('1001', '301', '3.4', '201802', '4')

 * sqlite:///cssys.db
1 rows affected.

[]

In [33]:
%%sql

INSERT INTO transcript VALUES ('1002', '100', '3', '201801', '3')

 * sqlite:///cssys.db
1 rows affected.

[]

In [34]:
%%sql

INSERT INTO transcript VALUES ('1002', '110', '3.2', '201901', '3')

 * sqlite:///cssys.db
1 rows affected.

[]

In [35]:
%%sql

INSERT INTO transcript VALUES ('1002', '301', '3.1', '201902', '4')

 * sqlite:///cssys.db
1 rows affected.

[]

In [36]:
%%sql

INSERT INTO transcript VALUES ('1003', '100', '2.5', '201801', '3')

 * sqlite:///cssys.db
1 rows affected.

[]

In [37]:
%%sql

INSERT INTO transcript VALUES ('1003', '120', '3.5', '201901', '4')

 * sqlite:///cssys.db
1 rows affected.

[]

In [38]:
%%sql

INSERT INTO transcript VALUES ('1003', '301', '2.8', '201902', '4')

 * sqlite:///cssys.db
1 rows affected.

[]

In [39]:
%%sql

INSERT INTO transcript VALUES ('1003', '354', '4', '201903', '3')

 * sqlite:///cssys.db
1 rows affected.

[]

In [40]:
%%sql

INSERT INTO transcript VALUES ('1003', '360', '3.5', '201802', '3')

 * sqlite:///cssys.db
1 rows affected.

[]

In [41]:
%%sql

SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3),
 (1001, 110, 3.5, 201801, 3),
 (1001, 120, 2.7, 201801, 4),
 (1001, 301, 3.4, 201802, 4),
 (1002, 100, 3.0, 201801, 3),
 (1002, 110, 3.2, 201901, 3),
 (1002, 301, 3.1, 201902, 4),
 (1003, 100, 2.5, 201801, 3),
 (1003, 120, 3.5, 201901, 4),
 (1003, 301, 2.8, 201902, 4),
 (1003, 354, 4.0, 201903, 3),
 (1003, 360, 3.5, 201802, 3)]

**Question 4: Query a database**

4.1 Show all rows in the students table

In [42]:
%%sql

SELECT * FROM students

 * sqlite:///cssys.db
Done.

[(1001, 'adam', 'smith', '2000-01-03', 'm', 3.1),
 (1002, 'alice', 'frank', '1999-03-11', 'f', 3.4),
 (1003, 'bob', 'hal', '1999-09-01', 'm', 2.0)]

4.2 Show rows whose credit is 3 in the courses table

In [56]:
%%sql

SELECT * FROM courses

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (120, 'web', 4, None),
 (301, 'networking', 4, 200),
 (301, 'networking', 4, 150),
 (301, 'networking', 4, 210),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

In [43]:
%%sql

SELECT * FROM courses
WHERE credit = 3

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

4.3 Show rows whose mark is larger than 3 and credit is no smaller than 3 in the transcript table

In [57]:
%%sql

SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3, 'B'),
 (1001, 110, 3.5, 201801, 3, 'A'),
 (1001, 120, 2.7, 201801, 4, 'C'),
 (1001, 301, 3.4, 201802, 4, 'B'),
 (1002, 100, 3.0, 201801, 3, 'B'),
 (1002, 110, 3.2, 201901, 3, 'B'),
 (1002, 301, 3.1, 201902, 4, 'B'),
 (1003, 100, 2.5, 201801, 3, 'C'),
 (1003, 120, 3.5, 201901, 4, 'A'),
 (1003, 301, 2.8, 201902, 4, 'C'),
 (1003, 354, 4.0, 201903, 3, 'A'),
 (1003, 360, 3.5, 201802, 3, 'A')]

In [44]:
%%sql

SELECT * FROM transcript
WHERE (mark > 3 AND credit >= 3)

 * sqlite:///cssys.db
Done.

[(1001, 110, 3.5, 201801, 3),
 (1001, 301, 3.4, 201802, 4),
 (1002, 110, 3.2, 201901, 3),
 (1002, 301, 3.1, 201902, 4),
 (1003, 120, 3.5, 201901, 4),
 (1003, 354, 4.0, 201903, 3),
 (1003, 360, 3.5, 201802, 3)]

4.4 Show studentid, courseid, and mark of all rows in the transcript

In [58]:
%%sql

SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3, 'B'),
 (1001, 110, 3.5, 201801, 3, 'A'),
 (1001, 120, 2.7, 201801, 4, 'C'),
 (1001, 301, 3.4, 201802, 4, 'B'),
 (1002, 100, 3.0, 201801, 3, 'B'),
 (1002, 110, 3.2, 201901, 3, 'B'),
 (1002, 301, 3.1, 201902, 4, 'B'),
 (1003, 100, 2.5, 201801, 3, 'C'),
 (1003, 120, 3.5, 201901, 4, 'A'),
 (1003, 301, 2.8, 201902, 4, 'C'),
 (1003, 354, 4.0, 201903, 3, 'A'),
 (1003, 360, 3.5, 201802, 3, 'A')]

In [45]:
%%sql

SELECT studentid, courseid, mark FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0),
 (1001, 110, 3.5),
 (1001, 120, 2.7),
 (1001, 301, 3.4),
 (1002, 100, 3.0),
 (1002, 110, 3.2),
 (1002, 301, 3.1),
 (1003, 100, 2.5),
 (1003, 120, 3.5),
 (1003, 301, 2.8),
 (1003, 354, 4.0),
 (1003, 360, 3.5)]

4.5 Show studentid, courseid, and mark of all rows in the transcript where semester value is 201902

In [59]:
%%sql

SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3, 'B'),
 (1001, 110, 3.5, 201801, 3, 'A'),
 (1001, 120, 2.7, 201801, 4, 'C'),
 (1001, 301, 3.4, 201802, 4, 'B'),
 (1002, 100, 3.0, 201801, 3, 'B'),
 (1002, 110, 3.2, 201901, 3, 'B'),
 (1002, 301, 3.1, 201902, 4, 'B'),
 (1003, 100, 2.5, 201801, 3, 'C'),
 (1003, 120, 3.5, 201901, 4, 'A'),
 (1003, 301, 2.8, 201902, 4, 'C'),
 (1003, 354, 4.0, 201903, 3, 'A'),
 (1003, 360, 3.5, 201802, 3, 'A')]

In [46]:
%%sql

SELECT studentid, courseid, mark FROM transcript
WHERE semester = 201902

 * sqlite:///cssys.db
Done.

[(1002, 301, 3.1), (1003, 301, 2.8)]

4.6 Show distinct courseid of all rows in the transcript table

In [60]:
%%sql

SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3, 'B'),
 (1001, 110, 3.5, 201801, 3, 'A'),
 (1001, 120, 2.7, 201801, 4, 'C'),
 (1001, 301, 3.4, 201802, 4, 'B'),
 (1002, 100, 3.0, 201801, 3, 'B'),
 (1002, 110, 3.2, 201901, 3, 'B'),
 (1002, 301, 3.1, 201902, 4, 'B'),
 (1003, 100, 2.5, 201801, 3, 'C'),
 (1003, 120, 3.5, 201901, 4, 'A'),
 (1003, 301, 2.8, 201902, 4, 'C'),
 (1003, 354, 4.0, 201903, 3, 'A'),
 (1003, 360, 3.5, 201802, 3, 'A')]

In [47]:
%%sql

SELECT DISTINCT courseid FROM transcript

 * sqlite:///cssys.db
Done.

[(100,), (110,), (120,), (301,), (354,), (360,)]

4.7 Show the firstname, lastname, gpa from the students table and sort by gpa

In [62]:
%%sql

SELECT * FROM students

 * sqlite:///cssys.db
Done.

[(1001, 'adam', 'smith', '2000-01-03', 'm', 3.1),
 (1002, 'alice', 'frank', '1999-03-11', 'f', 3.4),
 (1003, 'bob', 'hal', '1999-09-01', 'm', 2.0)]

In [48]:
%%sql

SELECT firstname, lastname, gpa FROM students
ORDER BY gpa DESC

 * sqlite:///cssys.db
Done.

[('alice', 'frank', 3.4), ('adam', 'smith', 3.1), ('bob', 'hal', 2.0)]

4.8 Compute the lettergrade of each row in the transcript table, and show studentid, courseid, and lettergrade of all rows in the transcript table

In [49]:
%%sql

ALTER TABLE transcript ADD lettergrade CHAR(1)

 * sqlite:///cssys.db
Done.

[]

In [50]:
%%sql

UPDATE transcript
SET lettergrade = 'A'
WHERE mark >= 3.5

 * sqlite:///cssys.db
4 rows affected.

[]

In [51]:
%%sql

UPDATE transcript
SET lettergrade = 'B'
WHERE mark >= 3 AND mark < 3.5

 * sqlite:///cssys.db
5 rows affected.

[]

In [52]:
%%sql

UPDATE transcript 
SET lettergrade = 'C'
WHERE mark >= 2.5 AND mark < 3

 * sqlite:///cssys.db
3 rows affected.

[]

In [53]:
%%sql

UPDATE transcript
SET lettergrade = 'D'
WHERE mark >= 2 AND mark < 2.5

 * sqlite:///cssys.db
0 rows affected.

[]

In [54]:
%%sql

UPDATE transcript
SET lettergrade = 'F'
WHERE mark < 2

 * sqlite:///cssys.db
0 rows affected.

[]

In [63]:
%%sql

SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3, 'B'),
 (1001, 110, 3.5, 201801, 3, 'A'),
 (1001, 120, 2.7, 201801, 4, 'C'),
 (1001, 301, 3.4, 201802, 4, 'B'),
 (1002, 100, 3.0, 201801, 3, 'B'),
 (1002, 110, 3.2, 201901, 3, 'B'),
 (1002, 301, 3.1, 201902, 4, 'B'),
 (1003, 100, 2.5, 201801, 3, 'C'),
 (1003, 120, 3.5, 201901, 4, 'A'),
 (1003, 301, 2.8, 201902, 4, 'C'),
 (1003, 354, 4.0, 201903, 3, 'A'),
 (1003, 360, 3.5, 201802, 3, 'A')]

In [55]:
%%sql

SELECT studentid, courseid, lettergrade FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 'B'),
 (1001, 110, 'A'),
 (1001, 120, 'C'),
 (1001, 301, 'B'),
 (1002, 100, 'B'),
 (1002, 110, 'B'),
 (1002, 301, 'B'),
 (1003, 100, 'C'),
 (1003, 120, 'A'),
 (1003, 301, 'C'),
 (1003, 354, 'A'),
 (1003, 360, 'A')]